### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=3956415882253857563]
null_resource.control_plane_build: Refreshing state... [id=5820371448267733992]
data.external.modal_source_hash: Reading...
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=1602974904064951328]
null_resource.linear_bot_build[0]: Refreshing state... [id=3650463539801202712]
module.slack_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=3b5b00a8efb34f108305eb27958b94b7]
module.github_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=c60644e2a4c7424e9fac47366f048231]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=81c3c78c79fd41f19beff874f7243e63]
cloudflare_d1_database.main: Refreshing state... [id=ad942169-3035-4b98-bea5-95caf2d31fe1]
null_resource.github_bot_build[0]: Refreshing state... [id=2879926574467075165]
module.linear_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=327d7adf84b84ba38119d949998f16ff]
null_resource.slack_bot_build[0]: Refreshing state... [id=821158182995816114]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=9203773922585747258]
module.web_app[0].vercel_project.this: Refreshing state... [id=prj_1qn6Fn9eXBs6jgYbYozWTVXtKynG]
null_resource.d1_migrations: Refreshing state... [id=3721848595268281640]
module.slack_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=07c33d64272c4dcbac754ff9b2892e1d]
module.linear_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=6b59162bd70546cd85e59d72e3841ccc]
module.web_app[0].vercel_project_environment_variable.env[0]: Refreshing state... [id=jH3KNGPHb6SBLD3i]
module.web_app[0].vercel_project_environment_variable.env[8]: Refreshing state... [id=MUrnKGxXZQabPIId]
module.web_app[0].vercel_project_environment_variable.env[4]: Refreshing state... [id=neXB8L9ltjv2pJpe]
module.web_app[0].vercel_project_environment_variable.env[1]: Refreshing state... [id=HYijhIKwMUpkqJ0v]
module.web_app[0].vercel_project_environment_variable.env[5]: Refreshing state... [id=E5F2x8m3kgkmi5kf]
module.web_app[0].vercel_project_environment_variable.env[6]: Refreshing state... [id=GIyxpNRXymsZawFA]
module.web_app[0].vercel_project_environment_variable.env[2]: Refreshing state... [id=rM8Jh9I6wDjZbTYb]
module.web_app[0].vercel_project_environment_variable.env[7]: Refreshing state... [id=dlgvUJtCJD09w8Qo]
module.web_app[0].vercel_project_environment_variable.env[3]: Refreshing state... [id=qIpAaPYUAECP73Dm]
module.slack_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=98fdcfcd-197e-4bab-9cc1-d051c92236c5]
module.linear_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=96461001-6646-4c67-9088-f6bcb52b20d6]
module.slack_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=af8c0189-803d-4596-989e-1cc769f4088f]
module.linear_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=877c010a-8094-478d-a4be-541ad22d4330]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=801d7bf8ebcf4a2fa8737cd1d4e2e2fc]
module.control_plane_worker.cloudflare_workers_cron_trigger.this[0]: Refreshing state... [id=open-inspect-control-plane-arktms]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=0bc9abdb-9ad9-44ec-bc4f-9640eca99ef9]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=5af4d5dc-7af4-474e-bf4f-c590e1e9a109]
module.github_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=01f32f7baab1453db2285616eda088e4]
module.github_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=0b87c1c6-e55a-4d24-a61c-f8b88c560ef7]
module.github_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=539417d8-ebec-4246-8e83-204722a5d5fd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "5820371448267733992" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-20T15:12:53Z" -> (known after apply)
        }
    }

  # null_resource.github_bot_build[0] must be replaced
-/+ resource "null_resource" "github_bot_build" {
      ~ id       = "2879926574467075165" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-20T15:12:53Z" -> (known after apply)
        }
    }

  # null_resource.linear_bot_build[0] must be replaced
-/+ resource "null_resource" "linear_bot_build" {
      ~ id       = "3650463539801202712" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-20T15:12:53Z" -> (known after apply)
        }
    }

  # null_resource.slack_bot_build[0] must be replaced
-/+ resource "null_resource" "slack_bot_build" {
      ~ id       = "821158182995816114" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-03-20T15:12:53Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-20T15:13:03Z" -> (known after apply)
      ~ id                  = "0bc9abdb-9ad9-44ec-bc4f-9640eca99ef9" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 18 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 4 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "noah@arktms.com" -> (known after apply)
      ~ created_on   = "2026-03-20T15:13:04Z" -> (known after apply)
      ~ id           = "5af4d5dc-7af4-474e-bf4f-c590e1e9a109" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "0bc9abdb-9ad9-44ec-bc4f-9640eca99ef9" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-20T15:13:05Z" -> (known after apply)
      ~ id                  = "0b87c1c6-e55a-4d24-a61c-f8b88c560ef7" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 16 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 3 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "noah@arktms.com" -> (known after apply)
      ~ created_on   = "2026-03-20T15:13:07Z" -> (known after apply)
      ~ id           = "539417d8-ebec-4246-8e83-204722a5d5fd" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "0b87c1c6-e55a-4d24-a61c-f8b88c560ef7" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-20T15:12:54Z" -> (known after apply)
      ~ id                  = "96461001-6646-4c67-9088-f6bcb52b20d6" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 19 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 4 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.linear_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "noah@arktms.com" -> (known after apply)
      ~ created_on   = "2026-03-20T15:12:55Z" -> (known after apply)
      ~ id           = "877c010a-8094-478d-a4be-541ad22d4330" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "96461001-6646-4c67-9088-f6bcb52b20d6" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.modal_app.null_resource.modal_deploy must be replaced
-/+ resource "null_resource" "modal_deploy" {
      ~ id       = "9203773922585747258" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "source_hash"     = "eb61ee40339dc670899da0834e609e01e990c85a3059c7a9bf78bb610a2a6d22" -> "453c0773f75084f3504e21b689e545af683c53be4c5db384949bfabfce09265c"
            # (3 unchanged elements hidden)
        }
    }

  # module.slack_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-03-20T15:12:54Z" -> (known after apply)
      ~ id                  = "98fdcfcd-197e-4bab-9cc1-d051c92236c5" -> (known after apply)
      + limits              = (known after apply)
      ~ number              = 19 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 4 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.slack_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "noah@arktms.com" -> (known after apply)
      ~ created_on   = "2026-03-20T15:12:55Z" -> (known after apply)
      ~ id           = "af8c0189-803d-4596-989e-1cc769f4088f" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "98fdcfcd-197e-4bab-9cc1-d051c92236c5" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 13 to add, 0 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @Hirshey*